Revit 2027 API
TopographyEditScope Methods
The TopographyEditScope type exposes the following members.
Methods
Name | Description
Cancel |  Cancels the edit scope.
(Inherited from EditScope)
Commit |  Finishes the edit scope.
(Inherited from EditScope)
Dispose
(Inherited from EditScope)
Equals | Determines whether the specified object is equal to the current object.
(Inherited from Object)
GetHashCode | Serves as the default hash function.
(Inherited from Object)
GetType | Gets the Type of the current instance.
(Inherited from Object)
Start |  Starts a topography surface edit mode for an existing TopographySurface element.
ToString | Returns a string that represents the current object.
(Inherited from Object)
Top
See Also
Reference
TopographyEditScope Class
Autodesk.Revit.DB.Architecture Namespace